var app = new Vue({
    el: '#app',
    data: {
        list: [
            {
                'name': '高等数学',
                'group_id': '570136376'
            },
            {
                'name': '线性代数',
                'group_id': '671348341'
            },
            {
                'name': '概率统计',
                'group_id': '499037750'
            },
            {
                'name': '数理方法',
                'group_id': '160156378'
            },
            {
                'name': '大学物理',
                'group_id': '124505509'
            },
            {
                'name': '大学化学',
                'group_id': '583286495'
            },
            {
                'name': '电路理论/中文班',
                'group_id': '251360355'
            },
            {
                'name': '电路理论/英文班',
                'group_id': '518421574'
            },
            {
                'name':'电工与电子技术（G）',
                'group_id':'724298631'
            },
            {
                'name': '数字/模拟电子技术',
                'group_id': '132927097'
            },
            {
                'name': '模拟电子技术/双语班',
                'group_id': '723742472'
            },
            {
                'name': '电子技术实验',
                'group_id': '602744618'
            },
            {
                'name': '信号与系统',
                'group_id': '482344546'
            },
            {
                'name': '嵌入式系统原理与实验',
                'group_id': '702243911'
            },
            {
                'name': '电磁场',
                'group_id': '723756925'
            },
            {
                'name': '电工与电子技术',
                'group_id': '724298631'
            },
            {
                'name': 'C++',
                'group_id': '670702558'
            },
            {
                'name': '离散数学/数据结构',
                'group_id': '568032383'
            },
            {
                'name': '理论力学',
                'group_id': '531501313'
            },
            {
                'name': '工程设计图学',
                'group_id': '159098621'
            },
            {
                'name': '法语',
                'group_id': '263449613'
            },
            {
                'name': '交大选课交流群',
                'group_id': '687079642'
            }
        ]
    }
})